tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
brew "docker"
brew "python@3.9"
brew "docker-compose"
brew "git"
brew "jenv"
brew "kotlin"
brew "maven"
brew "openjdk@11"
brew "openjdk@8"
brew "tldr"
brew "wget"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "docker"
cask "iterm2"
cask "postman"
cask "textmate"
