tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mikesmithgh/git-prompt-string"
tap "romkatv/powerlevel10k"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Tool for emulating mouse and keyboard events
brew "cliclick"
# GNU File, Shell, and Text utilities
brew "coreutils"
# LCS based diff highlighting tool to ease code review from your terminal
brew "diffr"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose", link: false
# Modern replacement for 'ls'
brew "exa"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Bash and Zsh completion for Gradle
brew "gradle-completion"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake", link: false
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Manage multiple Node.js versions
brew "nvm"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Theme for zsh
brew "powerlevel10k"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Internet file retriever
brew "wget"
# Userspace Go implementation of WireGuard
brew "wireguard-go"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# A shell agnostic git prompt written in Go
brew "mikesmithgh/git-prompt-string/git-prompt-string"
# Grocery shopping list
cask "anylist"
# Multi-track audio editor and recorder
cask "audacity"
# Video editor
cask "avidemux"
# Installer for BetterDiscord
cask "betterdiscord-installer"
# Compare files and folders
cask "beyond-compare"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Write, edit, and chat about your code with AI
cask "cursor"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Productivity app
cask "dropzone"
# Web browser focusing on privacy
cask "duckduckgo"
# VPN client for secure internet access and private browsing
cask "expressvpn"
# Collaborative team software
cask "figma"
cask "font-hack-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Open-source video transcoder
cask "handbrake"
# Menu bar application that displays the CPU speed limit due to thermal issues
cask "hot"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File archiver
cask "keka"
# Video format converter (transcoder)
cask "makemkv"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Set of tools to create, alter and inspect Matroska files (MKV)
cask "mkvtoolnix"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Home media player
cask "plex"
# Collaboration platform for API development
cask "postman"
# NAS management application
cask "qfinder-pro"
# Automatic file synchronisation
cask "qsync-client"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# General-purpose text editor
cask "textmate"
# Charting and social-networking for investment traders
cask "tradingview"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Agentic IDE powered by AI Flow paradigm
cask "windsurf"
vscode "k--kato.intellij-idea-keybindings"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
